#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-FXrGCNfRk86z9E4r

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_api_gateway.data.archive_file.function_archive: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_api_gateway.data.archive_file.function_archive: Refresh complete after 0s [id=041c9899188570a312d7171465c917e45b766b84]
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=a8eb6da38c7e1d31adc2af363472a1d492c6220a]
module.sample_api_gateway.aws_iam_role.iam_for_lambda_apigw: Refreshing state... [id=iam_lambda_apigw]
module.agencies.aws_iam_role.iam_for_agencies_lambda: Refreshing state... [id=iam_for_agencies_lambda]
module.sample_api_gateway.aws_api_gateway_rest_api.api_gateway_rest_api: Refreshing state... [id=ips6gacda4]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=sample_s3_lambda.zip]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.sample_dynamodb_table.aws_dynamodb_table.tf_example_table: Refreshing state... [id=tf-test-table]
module.sample_api_gateway.aws_s3_object.file_upload: Refreshing state... [id=tf-lambda-apigw-sample.zip]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.agencies.aws_lambda_function.agencies: Refreshing state... [id=agencies]
module.sample_api_gateway.aws_api_gateway_resource.api_gateway: Refreshing state... [id=ryx13w]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Refreshing state... [id=lambdaS3Example]
module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example: Refreshing state... [id=tf-api-gateway]
module.sample_api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-ips6gacda4-ryx13w-GET]
module.sample_api_gateway.aws_lambda_permission.lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sample_api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-ips6gacda4-ryx13w-GET]
module.sample_api_gateway.aws_api_gateway_deployment.api_gateway_deployment: Refreshing state... [id=st19iv]
module.agencies.aws_lambda_function.agencies: Drift detected (update)
module.agencies.aws_iam_role.iam_for_agencies_lambda: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod will be created
  + resource "aws_dynamodb_table" "agencies_prod" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "agencyId"
      + id               = (known after apply)
      + name             = "agencies-prod-table"
      + range_key        = "owner"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 2

      + attribute {
          + name = "agencyId"
          + type = "S"
        }
      + attribute {
          + name = "owner"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "owner"
          + name               = "AgencyOwner"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "agencyId"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test will be created
  + resource "aws_dynamodb_table" "agencies_test" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "agencyId"
      + id               = (known after apply)
      + name             = "agencies-test-table"
      + range_key        = "owner"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 2

      + attribute {
          + name = "agencyId"
          + type = "S"
        }
      + attribute {
          + name = "owner"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "owner"
          + name               = "AgencyOwner"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "agencyId"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_apigateway_example" {
        id                             = "tf-api-gateway"
      ~ last_modified                  = "2023-06-24T00:37:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "MuixUm9ZYjLsPEuXnJD6vEGUuxxXN3aB91OUYPQBVBU=" -> "kEAx2ezOjpiwEpWHuuN9fML0xIfHTryy2ZVcUoQVnVs="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sample_api_gateway.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "ec75312b1143e7f3263a96954ae3754b" -> "a8526464d17b953ea2af3886c1dd064a"
        id                     = "tf-lambda-apigw-sample.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_s3_example" {
        id                             = "lambdaS3Example"
      ~ last_modified                  = "2023-06-24T00:37:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "VUj6B7jsFV5wt2v0Yjg+dhi16Uf377eW2H6yavLwEkg=" -> "8FK6xRtAlXqoSPOU2LiMGxadnPYFgVVtKe9x68MtGzU="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "a800f08012c0581f74f036aed5531cc9" -> "f32f16ac00498cb4dad15d59a02a1702"
        id                     = "sample_s3_lambda.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*